Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Finally, the maximum efficiency is typically achieved when the output array of a vectorized operation is pre-allocated, so that repeated calls do not allocate new arrays over and over again for the results (see Pre-allocating outputs).
ja: 最後に、最大効率は、ベクトル化された演算の出力アレイの場合に、典型的に達成される。 は事前割り当てであるため、繰り返し呼び出しは、新しいアレイを繰り返し割り当てないようにします。 結果(事前割り当ての事前割り当て<x/>)を参照してください。

source: Finally, you can use `ccall` to actually generate a call to the library function.
ja: 最後に、`ccall'を使ってライブラリ関数への呼び出しを実際に生成することができます。

source: Finally, you can use `ccall` to actually generate a call to the library function. Arguments to `ccall` are as follows:
ja: 最後に、`ccall'を使ってライブラリ関数への呼び出しを実際に生成することができます。引数は引数を指定します。 'ccall'は次のようになります。

source: Finally,where is parsed as an infix operator for writing parametric method and type definitions.
ja: 最後には、がパラメトリックメソッドを記述するためのインフィックス演算子として構文解析される。 定義します。

source: Finite numbers are ordered in the usual manner.
ja: 有限数は標準的な方法で順序付けされます。

source: First, a review of some relevant Julia type terminology:
ja: まず、いくつかの関連するJulia型用語のレビューを行います。

source: First, if the opening """ is followed by a newline, the newline is stripped from the resulting string.
ja: まず、始めの """ の後ろに改行が続いた場合、結果の文字列から改行は取り除かれます。

source: Floating-Point Numbers
ja: 浮動小数点数

source: Floating-point arithmetic entails many subtleties which can be surprising to users who are unfamiliar with the low-level implementation details.
ja: 浮動小数点数演算は、あまり経験のないユーザには難しいかもしれませんが、多くの応用的な知識が必要です。

source: Floating-point numbers are compared according to the IEEE 754 standard:
ja: 浮動小数点数は >IEEE 754規格 に準拠して比較されます。

source: Floating-point numbers have two zeros, positive zero and negative zero.
ja: 浮動小数点数は2つのゼロ を持ちます。すなわち、正のゼロと、負のゼロです。

source: Floating-point zero
ja: 浮動小数点0

source: Following the outer constructor definitions, we defined a number of methods for the ⊘
ja: 外部コンストラクタ定義に従って、θのためにいくつかの方法を定義しました。

source: For `BigFloat` the GNU MPFR library is used, and for `BigInt` the
ja: その他 'BigFloat'GNU MPFRライブラリは使用されます。 そして'BigInt'

source: For example:
ja: 例えば:

source: For further discussion of UTF-8 encoding issues, see the section below on (@ref man-byte-array-literals).
ja: UTF-8に関するさらなる議論については、以下の(@ref man-byte-array-literals)バイト配列リテラル のセクションを参照してください。

source: For AbstractArray types, defining a BroadcastStyle supersedes the fallback choice, `Broadcast.DefaultArrayStyle`.
ja: AbstractArrayタイプでは、BroadcastStyleを定義することによって、フォールバック選択が優先されます。 `ブロードキャスト.DefaultArrayStyle'.

source: For AbstractArrays that only support a certain dimensionality, create a subtype of Broadcast.AbstractArrayStyle{N} (see below).
ja: 特定の次元のみをサポートするAbstractArraysでは、ブロードキャストのサブタイプを作成します。AbstractArrayStyle{N}(以下を参照)。

source: For every binary operation like ^, there is a corresponding "dot" operation .^ that is automatically defined to perform ^ element-by-element on arrays.
ja: ^のようにのバイナリ演算に対しては、対応するものが存在する。 「ドット」操作.^は自動的に定義され、は自動的に定義されます 配列上で^エレメント単位で実行することができます。

source: For C code accepting pointers, `Ref{T}` should generally be used for the types of input arguments, allowing the use of pointers to memory managed by either Julia or C through the implicit call to `Base.cconvert`.
ja: Cコードを受け入れるには ポインタ、'Ref{T}は、一般的に入力引数のタイプに使用されるべきであり、使用されることができる。 は、'Base.チコンベルト'への暗黙的な呼び出しを介して、JuliaまたはCによって管理されるメモリへのポインタを示します。

source: For a brief but lucid presentation of how floating-point numbers are represented, see John D. Cook's article
ja: 浮動小数点数の表現に関するの簡潔かつ明快な説明は、John D. Cookの紹介記事を参照してください。

source: For a complete example, let's say you have created a type, ArrayAndChar, that stores an array and a single character:
ja: 完全な例では、ArrayAndCharというタイプを作成し、それを保存するとします。 配列と単一文字:

source: For a complete list of every Julia operator's precedence, see the top of this file: `src/julia-parser.scm`
ja: ジュリア演算子の優先順位のの完全なリストについては、このファイルの一番上を参照してください。 `src/julia parser.scm'

source: For a handful of other types (including but not limited to types themselves, functions, special singletons like `missing` and `nothing`, and dates), Base.broadcastable returns the argument wrapped in a Ref to act as a 0-dimensional "scalar" for the purposes of broadcasting.
ja: その他の種類(これに限定されるものではないが タイプ自身、関数、'missing"、`nothing"のような特別な単一トン、そして日付)などです。 Base.broadcastableは、Refでラップされた引数を返し、0次元として動作します。 ブロードキャストのための「スカラー」。

source: For a more general way to make all such calls work sensibly, see (@ref conversion-and-promotion).
ja: このような呼び出しをすべて適切に動作させるための一般的な方法は、(@ref変換とプロモーション)を参照してください。

source: For an excellent, in-depth discussion of floating-point numbers and issues of numerical accuracy encountered when computing with them, see David Goldberg's paper What Every Computer Scientist Should Know About Floating-Point Arithmetic.
ja: 浮動小数点数に関する高度かつ詳細な議論および演算時の数値の精度の問題については、David Goldbergの論文 What Every Computer Scientist Should Know About Floating-PointArithmeticを参照してください。

source: For an overview of why functions like `hypot()`, `expm1()`, and `log1p()`
ja: `hypot()`, `expm1()` および`log1p()` などの関数が必要かつ有用な理由については、

source: For an overview of why functions like `hypot`, `expm1`, and `log1p`
ja: なぜなら、'のような関数が、なぜ""、"、、"log1p"のようなものであるのかの概要である。

source: For direct C++ interfacing, see the Cxx package.
ja: 直接的なC++インターフェイスの場合は、Cxxパッケージを参照してください。

source: For even more extensive documentation of the history of, rationale for, and issues with floating-point numbers, as well as discussion of many other topics in numerical computing, see the collected writings
ja: より広範囲な歴史や合理性、浮動小数点数の問題に関する文献、およびその他の数値計算に関する議論については、「浮動小数点の父」として知られる William Kahanの論文を参照してください。

source: For example (from base/libc.jl) we see the same gethostname`ccall` as above, but with the correct signature for Windows:
ja: たとえば ベース/libc.jlは上記と同じようにgethostname`ccall'のように見えますが、正しいものは正しいものです。 Windowsのシグニチャ:

source: For example sin can be applied to all elements in the vector A, like so:
ja: たとえば、sinは、A<X21/>のベクトルのすべての要素に適用できます。これは、次のようになります。

source: For example 2^3x is parsed as 2^(3x), and 2x^3 is parsed as 2*(x^3).
ja: 例えば2^3xは2^(3x)と解析され、2x^3は2*(x^3)と構文解析される。

source: For example,
ja: たとえば

source: For example, size(A) == size(B) || throw(DimensionMismatch("size of A not equal to size of B"))
ja: たとえば サイズ(A)==サイズ(B)スロー(Bのサイズに等しくないDimensionMismatch("サイズはBの大きさに等しくない"))

source: For example, [1,2,3] ^ 3 is not defined, since there is no standard mathematical meaning to "cubing" a (non-square) array, but [1,2,3] .^ 3 is defined as computing the elementwise (or "vectorized") result [1^3, 2^3, 3^3].
ja: たとえば [1,2,3]^3は定義されていません。これは、標準がないためです。 (非正方形の)配列を"cubing"するための数学的意味はあるが [1,2,3].^3は、要素を計算するために定義されています。 (または"ベクトル化された")結果[1^3 2^3 3^3]。

source: For example, sin.(cos.(X)) is equivalent to broadcast(x -> sin(cos(x)), X), similar to [sin(cos(x)) for x in X]: there is only a single loop over X, and a single array is allocated for the result.
ja: たとえば sin.(cos.(X))は、ブロードキャスト(x->sin(cos(x))、X)(X)(x)(x)に相当します。 Xには1つのループしか存在せず、結果に対して単一の配列が割り当てられます。

source: For example, the following program, when compiled with julia -O3 generates two SIMD addition instructions (addps) on x86 systems:
ja: たとえば julia-O3でコンパイルされると、次のプログラムは2つのSIMD付加命令を生成します。 x86システム上での(アデプス)

source: For example, 1 is an integer literal, while 1.0 is a floating-point literal; their binary in-memory representations as objects are numeric primitives.
ja: たとえば、1は整数リテラルであり、1.0は浮動小数点リテラルです。それらのオブジェクトの、2進数メモリー内表現が、数値プリミティブです。

source: For example, Dict(i => f(i) for i = 1:10).
ja: 例えば、Dict(i=>f(i=>f(i)for i=1:10))。

source: For example, `sqrt` behaves differently when applied to -1 versus -1 + 0im even though -1 == -1 + 0im:
ja: 例えば、`sqqrt'は異なった振る舞いをします -1対-1+0imは、-1==-1+0imに適用されます。

source: For example, f(x::T) where {T} = ccall(:valid, Ptr{T}, (Ptr{T},), x)
ja: 例えば、f(x::T)は、{T}=ccall(:valid,Ptr{T},(Ptr{T},),x)である。

source: For example, Any[x, y, z] constructs a heterogeneous array that can contain any values.
ja: たとえば、任意の[x,y,z]は、任意の値を含むことができる異機種間配列を構成します。

source: For example, X .= sin.(Y) is equivalent to broadcast!(sin, X, Y), overwriting X with sin.(Y) in-place.
ja: たとえば、X.=sin.(Y)は、ブロードキャスト!(sin,X,Y)に相当します。 Xをsinで上書きします。(Y)インプレースで上書きします。

source: For example, `SparseMatrixCSC` from the SparseArrays standard library module, only supports two dimensions, so it just defines getindex(A::SparseMatrixCSC, i::Int, j::Int).
ja: 例えば、SparseArraysのは、の<x/>から<x/>の範囲である。SparseMatrixCSC ライブラリモジュールは、2つの次元のみをサポートしているため getindex(A::SparseMatrixCSC,i::Int,j::Int)。

source: For example, `sind(x)` computes the sine of x where x is specified in degrees.
ja: 例えば、`sind(x)` は、角度で指定された x の正弦を計算します。

source: For example, 0 .< A .< 1 gives a boolean array whose entries are true where the corresponding elements of A are between 0 and 1.
ja: 例えば、 0 .< A .< 1 は、 Aに 対応する要素が0と1の間に存在し、エントリが真であるブール値配列を返します。。。

source: For example, round(Int,x)
ja: 例えば、round(Int,x)は

source: For example, Dict{String,Int32}("A"=>1, "B"=>2).
ja: たとえば、Dict{String,Int32}("A"=>1, "B"=>2)を指定します。

source: For example, Fortran subroutines of the form
ja: たとえば、Fortranのサブルーチンは

source: For example, a customized square root function can be written to automatically call either the real or complex square root method on demand using Exceptions :
ja: たとえば、カスタマイズされた 平方根関数は、実数または複素数の平方根を自動的に呼び出すように書くことができます。 例外を使用した要求の方法:

source: For example, a function defined only for nonnegative numbers could be written to `throw` a `DomainError` if the argument is negative:
ja: たとえば、定義された関数は 負の数が指定された場合、負の数は'throw'a'DomainErrorに書き込まれます。 は否定的です。

source: For example, a module that can display PNG images in a window can register this capability with Julia, so that calling `display(x)` on types with PNG representations will automatically display the image using the module's window.
ja: たとえば、次のようなモジュールを表示することができます。 ウィンドウ内のPNGイメージは、この機能をJuliaに登録することができます。したがって、`display(x)`を呼び出すことができます。 PNG表示を持つタイプは、モジュールのウィンドウを使用してイメージを自動的に表示します。

source: For example, a recursive factorial routine could be defined like this:
ja: たとえば、再帰的な階乗ルーチンは次のように定義できます。

source: For example, a tuple representing an __m128
ja: 例えば、__m128を表すタプルは

source: For example, elements might be computed on request rather than stored.
ja: たとえば、要求に基づいて要素を計算することができます。 保存するのではなく。

source: For example, for CUDA, we need to be able to read the thread index:
ja: たとえば、CUDAの場合は、スレッド・インデックスを読み取る必要があります。

source: For example, if A is a gigabyte-sized array that you no longer need, you can free the memory with A = nothing.
ja: たとえば、Aが必要なくなったギガバイトサイズのアレイである場合は、メモリを解放することができます。 A=何もありません。

source: For example, if a C library declared a proper string type and returned a pointer to it:
ja: たとえば、Cライブラリが適切な文字列型を宣言し、そのポインタへのポインタを返した場合、次のようになります。

source: For example, if you compute 2 .* A.^2 .+ sin.(A) (or equivalently @.
ja: たとえば、2.*A.^2.+sin.(A)(または 等価的に@。

source: For example, if you define ⊗(A,B) = kron(A,B) to give a convenient infix syntax A ⊗ B for Kronecker products (`kron`), then [A,B] .⊗ [C,D] will compute [A⊗C, B⊗D] with no additional coding.
ja: たとえば、(A,B)=kon(A,B)を定義して便利な値を指定するとします。 infix syntaxA∩BKronecker製品の場合(kon')、次に [A,B].0.23[C,D]は、追加符号化なしで[AúC]を計算する。

source: For example, if you have f(x,y) = 3x + 4y, then f.(pi,A) will return a new array consisting of f(pi,a) for each a in A, and f.(vector1,vector2) will return a new vector consisting of f(vector1[i],vector2[i]) for each index i (throwing an exception if the vectors have different length).
ja: たとえば、f(x,y)=3x+4yの場合、f.(pi,A)は返されます。 aのaのf(pi,a)で構成される新しい配列であり、f.(vector1,vector2)は f(vector1[i],vector2[i])for each index<X21/>i(例外をスローする)で構成される新しいベクトル ベクトルの長さが異なる場合。

source: For example, it enables accessing the diagonal elements from the first "page" of A from above:
ja: たとえば 上からのAの最初の「ページ」からの対角線要素へのアクセス

source: For example, it is not clear whether 1.+x means 1.
ja: 例えば、1.+xが1を意味するかどうかは明らかではない。

source: For example, let's say you want to add a constructor method for Foo objects that takes only one argument and uses the given value for both the bar and baz
ja: たとえば、次のようにコンストラクタメソッドを追加するとします。 Fooオブジェクトは1つの引数をとり、barとbazの両方で指定された値を使用します。

source: For example, say we define a type that stores a vector along with an accurate representation of its sum:
ja: 例えば、正確な表現とともにベクトルを格納するタイプを定義するとします。 その合計:

source: For example, suppose one wants to declare a type that holds a pair of real numbers, subject to the constraint that the first number is not greater than the second one.
ja: たとえば、実数のペアを保持するタイプを宣言する場合は、次のように指定します。 最初の数値が2番目の数値より大きい制約がないことを示します。

source: For example, the sqrt() function throws a DomainError if applied to a negative real value:
ja: たとえば、負の実数値に sqrt() 関数を適用すると、DomainError が投げられます。

source: For example, the LegacyStrings.jl package implements UTF16String and UTF32String types.
ja: 例えば、LegacyStrings.jl パッケージは UTF16String および UTF32String型を実装しています。

source: For example, the `sqrt` function throws a `DomainError` if applied to a negative real value:
ja: 例えば、"sqqrt"関数は、負に印加された場合、<x/>"DomainErrorをスローする。 実価値:

source: For example, the `searchsorted` function uses this convention to indicate the insertion point of a value not found in a sorted array:
ja: たとえば、'のセアルチゾルタド関数は、この規則を使用して ソートされた配列に存在しない値の挿入点です。

source: For example, the code above will not work on hosts without AVX support.
ja: たとえば、上記のコードは AVXサポートのないホストでの作業を行います。

source: For example, the following call:
ja: たとえば、次の呼び出しを行います。

source: For example, the following code generates a function call where the number of arguments is determined programmatically:
ja: たとえば、次のコードは、引数の数が指定された関数呼び出しを生成します。 プログラムで決定されます。

source: For example, the following definition supports the negation of ranges:
ja: たとえば、次の定義は範囲の否定をサポートしています。

source: For example, the following expression sums a series without allocating memory:
ja: たとえば、次の式を指定します。 は、メモリを割り当てずに連続した値を加算します。

source: For example, the result of A[2, I, 3] is an array with size size(I).
ja: たとえば、A[2,I,3]の結果は sizeサイズ(I)の配列。

source: For example, the sparse array code has the following definitions:
ja: たとえば、疎な配列コードには次の定義があります。

source: For example, the variable name δ can be entered by typing \delta-tab, or even α̂₂ by \alpha-tab-\hat- tab-\_2-tab.
ja: 例えば、 変数名 δ は、\delta-tab とすることで入力できます。 また、 α̂₂ は、\alpha-tab-\hat-tab-\_2-tab とすることで入力できます。

source: For example, there's a formula to compute the sum of squares, so we can override the generic iterative version with a more performant solution:
ja: たとえば、2乗の合計を計算するための数式があります。 汎用的な反復バージョンをより効率的なソリューションでオーバーライドすることができます。

source: For example, this definition:
ja: 例として、この定義を見てみましょう。

source: For example, this is used to convert an Array of objects (e.g. strings) to an array of pointers.
ja: たとえば、これは、オブジェクトの配列をポインタの配列に変換するために使用されます。

source: For example, to call the getenv function to get a pointer to the value of an environment variable, one makes a call like this:
ja: たとえば、getenv関数を呼び出してポインタを取得するには、次のように指定します。 環境変数の値は、次のような呼び出しを行います。

source: For example, to just print the arguments given to a script, you could do this:
ja: 例えば以下のようにすることで、スクリプトに渡された引数を単純に出力することができます。

source: For example, to match C prototypes of the form:
ja: たとえば、フォームのCプロトタイプに一致させるには、次のようにします。

source: For example, we could have requested the result in single precision by writing:
ja: 例えば 以下のように記述することによって、単精度での結果が得られます。

source: For example, when T is `Int32`, we would like S to be `Int64`.
ja: 例えば、Tが"Int32"である場合には、Sであることが望ましい。 `Int64/>であること。

source: For example, writing x += 3 is equivalent to writing x = x + 3:
ja: 例えば、 x += 3 と記載することでx = x + 3 と書くのと等価です。:

source: For example, you might look up the function via dlsym, then cache it in a shared reference for that session.
ja: たとえば、dlsymを使用して関数を検索することができます。 そのセッションの共有参照にキャッシュされます。

source: For fun, try inserting a println("mycompare($a, $b)")
ja: 楽しみには、println("ミコンパレ($a, $b)")を挿入してください。

source: For further discussion of how these non-finite floating-point values are ordered with respect to each other and other floats, see Numeric Comparisons.
ja: どのように非有限浮動小数点値がお互いに、およびその他の浮動値に対して順序付けられているかについては、 Numeric Comparisons.を参照してください。

source: For instance, consider this C routine that uses AVX intrinsics:
ja: たとえば、AVX組み込み関数を使用するCルーチンは次のようになります。

source: For instance, we would generally write -x + 2 to reflect that first x gets negated, and then 2 is added to that result.)
ja: 例えば、通常 -x + 2 と記載しますが、これは最初に x を負の数にし、その後 2 をその結果に足します。）。

source: For instance, when developing C code for use with Julia, one may need to compile, call the C code from Julia, then close the library, make an edit, recompile, and load in the new changes.
ja: たとえば、Juliaと共に使用するCコードを作成する場合は、コンパイルする必要があります。 Cコードをジュリアから呼び出して、ライブラリを閉じ、編集を行い、再コンパイルします。 新しい変更にロードされます。

source: For large scale numerical problems, speed always has been, continues to be, and probably always will be crucial: the amount of data being processed has easily kept pace with Moore's Law over the past decades.
ja: 大規模数値計算問題では計算速度はこれまでもこれからも、常に重大な問題です。 処理されるデータ量は過去数十年にわたってムーアの法則にしたがって増え続けています。

source: For large scale numerical problems, speed always has been, continues to be, and probably always will be crucial: the amount of data being processed has easily kept pace with Moore’s Law over the past decades.
ja: 大規模数値計算問題では計算速度はこれまでもこれからも、常に重大な問題です。 処理されるデータ量は過去数十年にわたってムーアの法則にしたがって増え続けています。

source: For many types, forming new objects by binding their field values together is all that is ever needed to create instances.
ja: 多くのタイプでは、フィールド値を結合することで新しいオブジェクトを作成することは、すべてのタイプであり インスタンスを作成する必要があります。

source: For more details on defining custom AbstractArray implementations, see the (@ref man-interface-array).
ja: カスタム定義の詳細については AbstractArray実装を参照してください。(@ref man interface array)を参照してください。

source: For more details on how to pass callbacks to C libraries, see this blog post.
ja: Cライブラリへのコールバックを渡す方法の詳細については、このブログ記事を参照してください。

source: For more details, see (@ref writing-binary-broadcasting-rules).
ja: 詳細は、(@ref writing binary broadcasting rules)を参照してください。

source: For more information, please see the LLVM Language Reference.
ja: 詳細については、「LLVM言語リファレンス」を参照してください。

source: For more information, see (@ref man-custom-indices).
ja: 詳細については、を参照してください。 (@ref manカスタムインデックス)。

source: For most computational purposes, arrays should contain objects of a more specific type, such as `Float64` or `Int32`.
ja: ほとんどの計算目的では、アレイは `Float64'または`Int32/>のようなより特定のタイプのオブジェクト。

source: For non-numeric values, and for fewer or more than two arguments, the function f remains undefined, and applying it will still result in a `MethodError`:
ja: 数値以外の値や2つ以上の引数の場合、関数fは未定義のままであり、そのまま適用すると次のようにMethodErrorがおこります。

source: For other types, isequal() defaults to calling `==()`, so if you want to define equality for your own types then you only need to add a `==()` method.
ja: その他の型については、 isequal() はデフォルトで `==()`を呼び出すため、 使用している型の等式を定義したい場合は、`==()` メソッドを追加することで定義することができます。

source: For other types, isequal defaults to calling `==`, so if you want to define equality for your own types then you only need to add a `==` method.
ja: 他のタイプについては、等価はデフォルトで==`を呼び出しますので、もしあなたがそれを定義する場合には 独自のタイプに対しては、'==`のメソッドを追加する必要があります。

source: For reasons that will become clear very shortly, additional constructor methods declared as normal methods like this are called outer constructor methods.
ja: 理由は 次のようなコンストラクタメソッドは、ごく短時間で明確になります。 は、外部コンストラクタ・メソッドと呼ばれます。

source: For some types, the machinery to "fuse" operations across nested levels of broadcasting is not available or could be done more efficiently incrementally.
ja: ある種のタイプでは、ネストされた放送レベルでの動作を「融合」するための機械が必要です。 は使用できないか、より効率的に段階的に実行される可能性があります。

source: For specializing broadcast on custom types, see
ja: カスタム・タイプでのブロードキャストの特殊化については

source: For the Squares iterable above, we can easily compute the ith element of the sequence by squaring it.
ja: 上記のの2乗iterable上では、シーケンスのi番目の要素を2乗することによって簡単に計算することができます。 そうです。

source: For the sake of clarity, let's try a two-way version first:
ja: わかりやすくするために まず2ウェイのバージョンを試してみましょう。

source: For these problems, one needs inner constructor methods.
ja: これらの問題に対しては、内部のコンストラクタのメソッドが必要です。

source: For this reason, eval is typically only used to form top-level definitions, for example when wrapping libraries that contain many similar functions.
ja: このため、evalは通常、最上位レベルの定義を形成するためにのみ使用されます。たとえば、次のようになります。 は、多くの類似する関数を含むライブラリをラップするときに使用されます。

source: For tools to create C++ bindings, see the CxxWrap package.
ja: C++を作成するためのツールについて バインディングは、CxxWrapパッケージを参照してください。

source: For translating a C argument list to Julia:
ja: C引数リストをJuliaに変換するには、次の手順に従います。

source: For translating a C return type to Julia:
ja: Cリターン・タイプをジュリアに変換するには:

source: Fortran name
ja: Fortran名

source: Fortunately, modern language design and compiler techniques make it possible to mostly eliminate the performance trade-off and provide a single environment productive enough for prototyping and efficient enough for deploying performance-intensive applications.
ja: 幸い、最近の言語設計やコンパイラの進歩によって、性能の低下を避けつつ、「生産的なプロトタイピング」と「高性能なアプリケーションの効率的なデプロイ」の両方をひとつの環境で提供することが可能になりました。

source: Fortunately, most Julia users can remain oblivious to the technical details of code loading and simply use the built-in package manager to add a package X to the appropriate project and manifest files and then write import X to load X without a further thought.
ja: 幸いなことに、ほとんどのJuliaユーザーは、コード読み込みの技術的な詳細を忘れ、組み込みパッケージ・マネージャーを使用して、適切なプロジェクトやマニフェスト・ファイルにパッケージ<x x/>x2/>を追加して、xをロードXに読み込むことはできません。

source: Fortunately, the above awkward idiom is unnecessary for iterating through the characters in a string, since you can just use the string as an iterable object, no exception handling required:
ja: 幸運なことに反復可能なオブジェクトとして文字列を使うことができ、それにより例外処理が不要になるため、 上の例のような冗長的な記述は不要です。:

source: Fortunately, there is an easy solution: call the function using `Base.invokelatest`:
ja: 幸いにも、簡単な解決策があって、Base.invokelatestを使って関数を呼び出せば、いいのです。

source: Fractions
ja: 分数

source: Free and open source (MIT licensed)
ja: フリーかつオープンソース（ MITライセンス ）

source: From these definitions, one obtains the following behavior:
ja: これらの定義から、次の動作が得られます。

source: From within the function, you cannot "unbind" x from this Array, but you can change its content.
ja: この機能の中からは、この配列からxの"バインド解除"はできません。 コンテンツを変更することができます。

source: Function
ja: 関数

source: Function arguments themselves act as new variable bindings (new locations that can refer to values), but the values they refer to are identical to the passed values.
ja: 関数の引数は、新しい変数を 束縛 (新しい値を参照)したように振る舞いますが、参照先は渡された値と同一です。

source: Function parameters can also be used to constrain the number of arguments that may be supplied to a "varargs" function (Varargs Functions).
ja: 関数のパラメータは、 "varargs"関数(可変引数関数)が受け取る引数の数を制限するためにも使用できます。

source: Functions are grouped by topic below.
ja: 関数は以下のトピックでグループ化されています。

source: Functions in Julia are first-class objects: they can be assigned to variables, and called using the standard function call syntax from the variable they have been assigned to.
ja: Julia において、関数は、 第一級オブジェクトです: 関数は、変数に代入したり、代入した変数から標準的な構文で呼び出したりできます。

source: Functions on Expressions
ja: Expressions上の関数

source: Functions that write to their arguments have names that end in !.
ja: 引数に書き込む関数は、名前の末尾を!とします。

source: Further Reading
ja: さらに読む

source: Furthermore, "dotted" updating operators like a .+= b (or @.
ja: さらに、「ドット」の更新演算子は、a.+=b(または@)のようなものです。

source: Garbage Collection Safety
ja: ゴミ回収の安全

source: Generated functions can achieve high efficiency at run time, but come with a compile time cost: a new function body must be generated for every combination of concrete argument types.
ja: 生成された関数は、実行時に高い効率を実現できますが、コンパイル時にはコストがかかります。 具体的な引数型の組合せごとに、新しい関数本体を生成する必要があります。

source: Generated values can be filtered using the if keyword:
ja: 生成された値は、キーワードの場合はを使用してフィルタできます。

source: Generator Expressions
ja: ジェネレータの式

source: Generators are implemented via inner functions.
ja: ジェネレータは内部関数によって実装されています。
